# R & Python 함수 기초 1

---

In [3]:
a=3

# a라는 변수가 갖는 데이터의 속성
class(a)

[1] "numeric"

```python
# 파이썬에서는
a = 3
# a라는 변수가 갖는 데이터의 속성
type(a)
```

---

In [4]:
1:6

[1] 1 2 3 4 5 6

```pyhon

# 파이썬에선

# 이렇게 입력해야 1부터 6까지 출력됨
list(range(1,7))
```

---

In [7]:
id = c(1,2,3,4,5)
name = c('태조','정종','태종','세종','문종')
life = c(12,123,4,1,24)

df = data.frame(id,name,life)
df

  id name life
1 1  태조  12
2 2  정종 123
3 3  태종   4
4 4  세종   1
5 5  문종  24

In [6]:
data.frame(id = c(1,2,3,4,5), fd=c(1,23,4,5,6),dff=c(123,4,5,6,7))

  id fd dff
1 1   1 123
2 2  23   4
3 3   4   5
4 4   5   6
5 5   6   7

In [11]:
# 어떤 class인가
attr(df,'class')

[1] "data.frame"

In [12]:
# 어떤 변수들이 있는가
attr(df,'names')

[1] "id"   "name" "life"

> 기존 df에 새로운 칼럼 덧 붙이기

In [14]:
# 칼럼 덧붙이기
children = c(12,31,23,123,23)

df$children = children
df

  id name life children
1 1  태조  12   12
2 2  정종 123   31
3 3  태종   4   23
4 4  세종   1  123
5 5  문종  24   23

```python
vars = {'id' :[1,23,4,5],
       'asdf':[124,123,123,123]
       ,'1234':
        [123,123,123,123]}

import pandas as pd

df = pd.DataFrame(vars,columns=['asdf','id'])
df

# 여기서 주의할 점
pd.Dataframe으로 df 생성해줄 때, columns를 list에 생성해주지 않아도 df에 col이 생성되긴 함.
그런데 columns의 역할이 vars라는 dict에서 columns리스트에 부합되는 칼럼만 뽑아서 df을 만들어주기도 함.
즉 다시 말하자면 ,vars에 있는 변수랑 columns에 있는 변수랑 일치되는 것만 뽑기도하고 원하는 순서로 칼럼을 형성하여 
df을 만들 수도 있고 그런 기능임

# 파이썬에서 type 확인할 땐
type(df)

# 칼럼확인
df.columns

```

----

In [36]:
# header = T  : 칼럼명 지정할 수 있게 해줌
# sep = ',' : 구분 기준 기호 설정

ds = read.csv('buy.txt', header = T,sep='\t')
ds1 = read.csv('buy.csv', header = T, sep=',')

# 그런데 사실 read.csv 나 read.table이나 혼용해서 써도 결과는 동일하다.

head(ds1,3)

  id year buy age edu income exp  co   ad    prod
1 1  2013 1   5   3   17600  8800  9.3 11.36  5.01
2 2  2013 0   4   2    2500  2300 10.2  0.39    NA
3 3  2013 0   3   1    6700  5400 30.6  3.83 16.67

```python
import pandas as pd

ds = pd.read_csv('buy.csv', header = 0, sep = ',')
ds1 = pd.read_csv('buy.txt', header = 0, sep = '\t')

# 그냥 csv 파일이나 table파일이나 read_csv 사용하면 된다. 

# header = 0 : 0은 row number를 의미

ds.head(3)
```

> 변수명이 명시되어 있지 않은 경우에 변수이름 설정 또는 변수명 변경

```r
# r에서
df = read_table('buy_noheader.txt', header=F)

# 칼럼명 이렇게 설정 가능하다.
names(df) = c('dav','Asda','asgf','asgdf','adv','ad')
# 또는
names(df) 대신에 colnames(df)로도 사용 가능하다. 

# rename variable name
library(data.table)
setnames(no_h, 'year', 'years')
setnames(no_h, 'prod', 'product')

- 혹은 아래와 같이 기존의 칼럼명을 새로운 칼럼명으로 변경해줄 수도 있다.

setnames(no_h, old=c('co', 'ad'), new=c('com', 'advert'))
```

```python
no_h = pd.read_csv("buy_noheader.txt",header= None, sep="\t")

# set up variable name
no_h.columns = ['id','year','buy','age','edu','income','exp','co','ad','prod']

# rename variable name
no_h.rename(columns = {"year": "years"}, inplace = True)
no_h.rename(columns = {"co": "com","ad": "advert"}, inplace = True)
```

---

In [41]:
attributes(df)

$names
[1] "id"       "name"     "life"     "children"

$row.names
[1] 1 2 3 4 5

$class
[1] "data.frame"

In [42]:
# 이렇게도 사용할 수 있겠다. 
attributes(df)$names

[1] "id"       "name"     "life"     "children"

```r
# 모든 변수들에 대한 요약통계
summary(ds)

# ds set에 대한 정보
attributes(ds) # object attributes
# attribute가 아니라 attributes이다
nrow(ds) # 행 수
ncol(ds) # 컬럼 수
names(ds) 		# 칼럼명

# data set 에서 특정한 변수를 이용하고자 할 경우에는 $ 표시 이용
mean(ds\$income)
var(ds\$income)
min(ds\$income)
quantile(ds\$income, 1/4)
median(ds\$income)
quantile(ds\$income, 3/4)
max(dsa\$income)
```

```python
# 모든 변수들에 대한 요약통계
ds.describe()

# ds set에 대한 정보
len(ds)
len(ds.index)
len(ds.columns)
ds.columns  # 이런 칼럼 주의하자
 


# data set 에서 특정한 변수를 이용하고자 할 경우에는 . 또는 ['변수명'] 이용
ds.income.mean()
ds['income'].var()
ds['income'].min()
ds['income'].quantile(1/4)
ds['income'].median()
ds['income'].quantile(3/4)
ds['income'].max()

뒤에 ()써주는 거 주의


```

----

In [46]:
df

  id name life children
1 1  태조  12   12
2 2  정종 123   31
3 3  태종   4   23
4 4  세종   1  123
5 5  문종  24   23

In [49]:
ds$buy[c(1:6)]

[1] 1 0 0 1 0 0

In [50]:
ds$buy = as.factor(ds$buy)

In [52]:
ds$buy[c(1:6)]

[1] 1 0 0 1 0 0
Levels: 0 1

- 달라진 게 없는 것 같다
- 요약 정보를 확인해보자

In [59]:
summary(ds)

       id             year      buy          age             edu
 Min.   :  1.0   Min.   :2013   0:517   Min.   :2.000   Min.   :1.000
 1st Qu.:175.8   1st Qu.:2013   1:183   1st Qu.:2.000   1st Qu.:1.000
 Median :350.5   Median :2014           Median :3.000   Median :1.000
 Mean   :350.5   Mean   :2014           Mean   :3.134   Mean   :1.723
 3rd Qu.:525.2   3rd Qu.:2015           3rd Qu.:4.000   3rd Qu.:2.000
 Max.   :700.0   Max.   :2015           Max.   :5.000   Max.   :5.000

     income           exp              co              ad
 Min.   : 1400   Min.   :  700   Min.   : 0.40   Min.   : 0.010
 1st Qu.: 2400   1st Qu.: 1800   1st Qu.: 5.00   1st Qu.: 0.370
 Median : 3400   Median : 2500   Median : 8.60   Median : 0.855
 Mean   : 4540   Mean   : 3300   Mean   :10.26   Mean   : 1.553
 3rd Qu.: 5425   3rd Qu.: 4025   3rd Qu.:14.12   3rd Qu.: 1.905
 Max.   :34600   Max.   :19600   Max.   :41.30   Max.   :20.560

      prod
 Min.   : 0.050
 1st Qu.: 1.045
 Median : 1.980
 Mean   : 3.060
 3rd Qu.: 3.935
 Max.   :27.030
 NA's   :1

- buy칼럼만 범주형 변수로 바뀐 것을 확인할 수 있다.

In [60]:
table(ds$buy)

  0   1
517 183

- 위와 같이 범주형 변수로 바뀐 것을 확인할 수 있다.

In [62]:
table(ds$buy, ds$edu)

      1   2   3   4   5
  0 293 139  57  24   4
  1  79  59  30  14   1

- python의 groupby와 좀 유사해보인다.

In [64]:
ds$edu = as.factor(ds$edu)
table(ds$buy, ds$edu)

      1   2   3   4   5
  0 293 139  57  24   4
  1  79  59  30  14   1

---

```python
# summary와 유사
ds.describe()

# 범주형 변수로 변환하기
ds['buy'].astype('category')

# 범주형 변수 요약
ds['buy'].value_counts()
```

---

```r
## 결측값 처리해보자

# prod 변수에서만 missing value 제거
prod_no_missing = na.omit(ds$prod)

# ds set에서 missing value가 있는 행 제거
ds2 = na.omit(ds)

# . 으로 입력되어 있는 경우 0 값으로 변경
ds$prod[ds$prod == '.'] <- 0

# ds$prod == '.' 이 부분이 Bool 형태로 반환되어 indexing에 활용할 수 있다. 
```

```python


# 결측값 채울 때 사용해보자
ds['prod'].mean()

# Na값을 하나라도 포함하는 행 삭제
# 결측값 하나 있다고 열을 다 삭제하긴 부담스러워서?
# 결측값있는 열이 아닌 결측값 있는 행을 삭제함.
ds.dropna()

# 행 전체가 Na인 행만 삭제
ds.dropna(how='all')
# how = 'all'
# 어떻게 지울까?
# all , 즉 모두 null인 것만 지우자


# 결측값 변경
ds['prod'].fillna(0)
ds['prod'].fillna(ds['prod'].mean())
```

---

In [71]:
min(ds$income)

[1] 1400

In [67]:
fn_sum = fivenum(ds$income)
fn_sum

[1]  1400  2400  3400  5450 34600

```r
### 데이터 분석 결과 활용 예
fn_sum = fivenum(ds$income)
# fievnum의 반환 결과
# (minimum, lower-hinge, median, upper-hinge, maximum)




### 예: 회귀 분석
summary(ds)
# 파이썬에서는 ds.describe()

# 범주형 변수로 변경
ds$buy = as.factor(ds$buy)

res = lm(income ~ buy, data=ds) 
res$coefficient
res$coefficient[1]
res$coefficient[2]

# 분산분석
anova(res)
```

---

```python
## 데이터 분석 결과 활용 예
res1 = ds['income'].describe()

import statsmodels.formula.api as smf


# 회귀분석 中
model = smf.ols(formula='exp~income', data=ds)
res = model.fit()
res_s = res.summary()
print(res_s)

print('Parameters: ', res.params)
print('Parameters: ', res.params[0])
print('R2: ', res.rsquared)
print('F value: ', res.fvalue)
```

---

```r
# 특정한 변수 이용: $
ds$income  
ds[, 6] 
# income는 6번째에 위치한 변수 
# 따라서 ds$income과 ds[, 6]은 같은 의미 

ds[, 6]
ds[, c(6, 7)]

mean(ds$income) #mean(ds[, 6])
sum(ds$exp)

### 특정한 관측치 이용
ds[1, ]
ds[c(1:5), ]
ds[c(1, 3, 5, 7), ]

### 관측치가 특정한 값인 데이터 이용
ds[ds$year==2013, ]	# == 
ds[ds$year!=2013, ]
```

---

```python
# 특정한 변수 이용:  . 또는 ['변수명'] 이용
ds.income  
ds['income']
ds.loc[:, 'income']


# list로 넣어주어야 함.
ds.loc[:, ['income', 'exp']]
ds.iloc[:, [5, 6]]

ds.income.mean()
ds['exp'].sum()

# 특정한 관측치 이용
ds.loc[0, :]
ds.loc[1:5, :]
ds.loc[[0, 2, 4, 6], :]

# 관측치가 특정한 값인 데이터 이용
# 만족하는 행만 나옴
ds[ds.year==2013]
ds[ds.year!=2013]

ds.loc[:,:][ds.year==2013]
ds.loc[:,:][ds.year!=2013]
```

```r
# data set에서 일부 데이터로 구성된 새로운 data set 생성 방법

# year, buy, income 변수로 구성된 새로운 data set
new_data = ds[, c(2, 3, 6)]
# subset 이용 유의해서 보자
# 첫 번째 인자는 불러올 dataset, 두 번째 인자는 조건!
new_data = subset(ds, select=c(year, buy, income))

# year, buy, income 변수를 제거한 data set
new_data = ds[, -c(2, 3, 6)]
#subset 이용 유의해서 보자
new_data = subset(ds, select=-c(year, buy, income))

# 2014년 이후 데이터로 구성된 새로운 data set
new_data = ds[ds$year>=2014, ] # 파이썬에서는 다 선택해주려면 콜론 붙여야하는데 
# r에서는 콜론 붙이지 않는다.
new_data = subset(ds, year>=2014)

# 2014년 이후, (year, buy, income) 변수로 구성
new_data = subset(ds, year>=2014, select=c(year, buy, income))



# data set에서 sample 추출
new_data = ds[sample(nrow(ds), 30), ]	
# 30 samples without replacement
# 비복원추출로


#30% sample : ceiling(), round(), floor()
s_n = ceiling(nrow(ds) * 0.3)	
new_data = ds[sample(nrow(ds), s_n), ]

```

```python
# data set에서 일부 데이터로 구성된 새로운 data set 생성 방법

# year, buy, income 변수로 구성된 새로운 data set
new_data = ds[['year', 'buy', 'income']]
new_data = ds.loc[:, ['year', 'buy', 'income']]
new_data = ds.iloc[:, [1, 2, 5]]

new_data = ds.iloc[:, [-1, -2, -5]] # -는 뒤에서부터


    
# 2014년 이후 데이터로 구성된 새로운 data set
new_data = ds[ds.year >= 2014]
new_data = ds.loc[:, :][ds.year>=2014]
new_data = ds.loc[ds.year>=2014, :]

# 2014년 이후, (year, buy, income) 변수로 구성
# 먼저 (year, buy, income)뽑아주고 그 다음 조건은 []여기에 넣어준다.
new_data = ds.loc[:, ['year', 'buy', 'income']][ds.year>=2014]


# data set에서 sample 추출
sam_data = ds.sample(n=30)	
# 30 samples without replacement


import math
s_n = math.ceil(len(ds) * 0.3)
sam_data = ds.sample(n = s_n)




```

---

```r
### 벡터의 각 원소에 동일한 값 가감
x = c(1, 2, 3, 4, 9)
y = 1
x1 = x + y
x2 = 10 - x

# 두 벡터가 동일한지 체크
y1 = c(1, 2, 3)
y2 = c(1, 2, 3)
# bool 형태로 반환된다
identical(y1, y2)

# 벡터를 인수로 받는 함수
sum(y1)		#모든 원소에 함수 적용
median(x)
sqrt(x)		#원소별로 함수가 적용

# 데이터 프레임에 새로운 변수 추가
ds = read.table("buy.txt", header=T)
dim(ds) -> 700,10 (크기)

# runif -> o~1 사이의 임의의 수
ds$gp = runif(dim(ds)[1]) # 새로운 변수 추가
new_data = subset(ds, gp<=0.5)

# ('T', 'F')와 같은 형태 값을 (0, 1) 형태로 변환
ds\$buy[ds\$buy == 0] <- 'F'
ds\$buy[ds\$buy == 1] <- 'T'

ds\$buy[ds\$buy == 'F'] <- 0
ds\$buy[ds\$buy == 'T'] <- 1
```

----

```python

# [1,2,3]+[1,2,3]
# [1,2,3,1,2,3] 이렇게 출력됨
# 그래서 원소별 연산을 하기 위해선 np사용




# 벡터의 각 원소에 동일한 값 가감
x = np.array([1, 2, 3, 4, 9])
y = np.array([1])
x1 = x+y
x2 = np.array([10])-x

# 두 벡터가 동일한지 체크
y1 = np.array([1, 2, 3])
y2 = np.array([1, 2, 3])
y1 == y2

# 벡터를 인수로 받는 함수
np.sum(y1)		#모든 원소에 함수 적용
np.median(x)
np.sqrt(x)		#원소별로 함수가 적용

# 데이터 프레임에 새로운 변수 추가
ds = pd.read_csv('buy.csv', header=0, sep=",")
ds['gp'] = np.random.uniform(0, 1, len(ds))
new_data = ds[ds.gp <= 0.5]

### ('T', 'F')와 같은 형태 값을 (0, 1) 형태로 변환
ds.buy[ds.buy == 0] = 'F'
ds.buy[ds.buy == 1] = 'T'

ds.buy[ds.buy == 'F'] = 0
ds.buy[ds.buy == 'T'] = 1
```

---

In [87]:
library(doBy)
summaryBy(income ~ age, ds)

  age income.mean
1 2   2668.473
2 3   4048.496
3 4   6907.879
4 5   6359.091

```r
library(doBy)

ds = read.table("buy.txt", header=T)

# 요약통계량
summary(ds)

# 그룹별 평균 
summaryBy(income ~ age, ds) 

summaryBy(. ~ age, ds) 



# 구매여부별 income의 평균 차이 분석
t.test(income ~ buy, data=ds, var.equal=TRUE)




# 연령별 income의 평균 차이 분석
ds\$age_gp = ifelse(ds\$age<=3, 'Young', 'old')
t.test(income ~ age_gp, data=ds, var.equal=TRUE)

```

```python
ds = pd.read_csv('buy.csv', header=0, sep=",")

# 요약통계량
ds.describe()
# 그룹별 평균
ds.income.groupby(ds.age).mean() 
ds.groupby(ds.age)['income'].mean() # 위 줄과 동일!
ds.groupby(ds.age).mean() 

from scipy import stats

# 구매여부별 income의 평균 차이 분석
b0 = ds.income[ds.buy==0]
b1 = ds.income[ds.buy==1]
stats.ttest_ind(b0, b1)


# 연령별 income의 평균 차이 분석
ds.loc[ds['age']<=3, 'age_gp'] = 'Young'
ds.loc[ds['age']>3, 'age_gp'] =  'Old’

# 또는
ds['age_gp'] = np.where(ds['age']<=3, 'Young', 'Old')
# r에서의 ifelse같은 기능

a0 = ds.income[ds.age_gp=='Young']
a1 = ds.income[ds.age_gp=='Old']

stats.ttest_ind(a0, a1)
```